#Декоднул @allahdec.
__import__("webbrowser").open("https://t.me/+-aF7ZoooDo5mYmVi")


import os  #Декоднул @allahdec.
import termcolor  #Декоднул @allahdec.
from termcolor import colored  #Декоднул @allahdec.

os.system('cls' if os.name == 'nt' else 'clear')

banner = '\n\n\n ███▄ ▄███▓▓██   ██▓  ██████ ▄▄▄█████▓▓█████  ██▀███ ▓██   ██▓\n▓██▒▀█▀ ██▒ ▒██  ██▒▒██    ▒ ▓  ██▒ ▓▒▓█   ▀ ▓██ ▒ ██▒▒██  ██▒\n▓██    ▓██░  ▒██ ██░░ ▓██▄   ▒ ▓██░ ▒░▒███   ▓██ ░▄█ ▒ ▒██ ██░\n▒██    ▒██   ░ ▐██▓░  ▒   ██▒░ ▓██▓ ░ ▒▓█  ▄ ▒██▀▀█▄   ░ ▐██▓░\n▒██▒   ░██▒  ░ ██▒▓░▒██████▒▒  ▒██▒ ░ ░▒████▒░██▓ ▒██▒ ░ ██▒▓░\n░ ▒░   ░  ░   ██▒▒▒ ▒ ▒▓▒ ▒ ░  ▒ ░░   ░░ ▒░ ░░ ▒▓ ░▒▓░  ██▒▒▒ \n░  ░      ░ ▓██ ░▒░ ░ ░▒  ░ ░    ░     ░ ░  ░  ░▒ ░ ▒░▓██ ░▒░ \n░      ░    ▒ ▒ ░░  ░  ░  ░    ░         ░     ░░   ░ ▒ ▒ ░░  \n       ░    ░ ░           ░              ░  ░   ░     ░ ░     \n            ░ ░                                       ░ ░     \n  '
print(colored(banner, 'magenta'))

main_text = '\n    1. ЗАХОДИМ В ВК И ЛИВАЕМ С АККАУНТА;\n\n    2. ВВОДИМ НОМЕР ЖЕРТВЫ И \n    ПЫТАЕМСЯ НЕСКОЛЬКО РАЗ ЗАЙТИ В \n    АККАУНТ ЖЕРТВЫ;\n\n    3. ЛОГИНИМСЯ В ЛЕВЫЙ АКК;\n\n    4. ЗАХОДИМ НА СТРАНИЦУ ЖЕРТВЫ И \n    ЖМЕМ НА 3 ТОЧКИ СВЕРХУ;\n\n    5. ВЫБИРАЕМ "Пожаловаться" А ПОТОМ \n    "Проблема с профилем";\n\n    6. ОТВЕЧАЕМ ДА ЭТО МОЙ ПРОФИЛЬ;\n\n    7. В "Старый номер телефона" ВВОДИM\n    НОМЕР ЖЕРТВЫ;\n\n    8. В "Доступный номер телефона" \n    ВВОДИМ НАШ ЛЕВЫЙ НОМЕР;\n\n    9. КИДАЕМ ЖБ\n'
print(colored(main_text, 'magenta'))

def main():  #Декоднул @allahdec.
    print('Нажмите Enter, чтобы перейти к другому файлу...')
    input()
    os.system('python main.py')
    exit()

if __name__ == '__main__':  #Декоднул @allahdec.
    main()
